RhinoInside.Revit API Documentation
GeometryEncoder.ToUV Method (Point2d)
 Converts the specified Rhino.Geometry.Point2d to an equivalent Autodesk.Revit.DB.UV.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.UV ToUV(
	this Rhino.Geometry.Point2d point
)
@staticmethod
def ToUV(
	point: Rhino.Geometry.Point2d
) -> Autodesk.Revit.DB.UV
Parameters
point
Type: Rhino.Geometry.Point2d
Rhino point to convert.
Return Value
Type: Autodesk.Revit.DB.UV
Revit point that is equivalent to the provided Rhino point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point2d. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToUV(Point2d) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.UV revitUVpoint = rhinoPoint2d.ToUV();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_uvpoint: DB.UV = rhino_point2d.ToUV()
 Using ToUV(Point2d) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.UV revitUVpoint = GeometryEncoder.ToUV(rhinoPoint2d);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_uvpoint: DB.UV = ge.ToUV(rhino_point2d)
See Also
Reference
GeometryEncoder Class
ToUV Overload
RhinoInside.Revit.Convert.Geometry Namespace